app/controllers/users_controller.rb

UPDATE "users" SET "pass" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["pass", "123456"], ["updated_at", "2019-05-22 08:21:51.371100"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)